Notas-de-clase/clase-20220815.md

# &Iacute;ndice

1.  [Apuntadores de estructuras](#org2a24ddd)
    1.  [Lectura de un arreglo de struct](#org194d870)



<a id="org2a24ddd"></a>

# Apuntadores de estructuras

Cuando se tiene un puntero a estructua, se puede acceder a los campos de la misma de dos formas diferentes. Desreferenciando el puntero o por medio del operador ".".

    Struct S
    {
      int a;
      float b;
    };
    Struct S var, *punt, arr[' '], *punt2;
    punt = &var;
    punt2 = &var[0];

Apuntadores

    *ptr;
    Inicialización:
    ptr = &var;
    ptr = A;
    ptr = A[' '];

Referencia a una estructua

-   definir la variable tipo estructura
    Struct S var; -> una variable
    Struct S var[' '];
-   Acceder a los miembros de la estructura:
    1.  Operador punto (.)
        
            // lectura para variable a
            scanf("%d", &var.a);
    2.  Operador flecha
        
            scanf("%d", punt->a);
            // alternativamente:
            scanf("%d", (*punt).a);


<a id="org194d870"></a>

## Lectura de un arreglo de struct

Se recomineda usar dos ciclos do while para la lectura a un arreglo de struct en comparación a un for. El ciclo externo controla el desplazamiento en el arreglo y el ciclo interno se encarga de verificar la información que se introduce al elemento del arreglo. Un for no se detendrá en medio del proceso de recorrer el arreglo y tampoco se detendrá si la información introducida es inválida.

    fflush(stdin); //limpia el stream de caracteres. Esto es porque en el stream después de un gets() queda un caracter Enter, lo que termina la lectura del stream la siguiente ejecución de gets()
    gets(); //obtiene el input;

    char num[30];
    gets(num); // =>Juan Perez
    long longi = strlen(num); = 10;
    for(int i = 0; i < longi; i++)
      while(num[i] != '\0');

